tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1933_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1933_H_
#define _PIC16F1933_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTE                         62
#define RE3                           63
#define PIR1                          64
#define TMR1IF                        65
#define TMR2IF                        66
#define CCP1IF                        67
#define SSPIF                         68
#define TXIF                          69
#define RCIF                          70
#define ADIF                          71
#define TMR1GIF                       72
#define PIR2                          73
#define CCP2IF                        74
#define LCDIF                         75
#define BCLIF                         76
#define EEIF                          77
#define C1IF                          78
#define C2IF                          79
#define OSFIF                         80
#define PIR3                          81
#define TMR4IF                        82
#define TMR6IF                        83
#define CCP3IF                        84
#define CCP4IF                        85
#define CCP5IF                        86
#define TMR0                          87
#define TMR1L                         88
#define TMR1H                         89
#define T1CON                         90
#define TMR1ON                        91
#define nT1SYNC                       92
#define T1OSCEN                       93
#define T1CKPS0                       94
#define T1CKPS                        95
#define T1CKPS1                       96
#define TMR1CS                        97
#define TMR1CS0                       98
#define TMR1CS1                       99
#define T1GCON                        100
#define T1GSS0                        101
#define T1GSS                         102
#define T1GSS1                        103
#define T1GVAL                        104
#define T1GGO_nDONE                   105
#define T1GGO                         106
#define T1GSPM                        107
#define T1GTM                         108
#define T1GPOL                        109
#define TMR1GE                        110
#define TMR2                          111
#define PR2                           112
#define T2CON                         113
#define T2CKPS0                       114
#define T2CKPS                        115
#define T2CKPS1                       116
#define TMR2ON                        117
#define T2OUTPS0                      118
#define T2OUTPS                       119
#define T2OUTPS1                      120
#define T2OUTPS2                      121
#define T2OUTPS3                      122
#define CPSCON0                       123
#define T0XCS                         124
#define CPSOUT                        125
#define CPSRNG                        126
#define CPSRNG0                       127
#define CPSRNG1                       128
#define CPSRM                         129
#define CPSON                         130
#define CPSCON1                       131
#define CPSCH                         132
#define CPSCH0                        133
#define CPSCH1                        134
#define CPSCH2                        135
#define TRISA                         136
#define TRISA0                        137
#define TRISA1                        138
#define TRISA2                        139
#define TRISA3                        140
#define TRISA4                        141
#define TRISA5                        142
#define TRISA6                        143
#define TRISA7                        144
#define TRISB                         145
#define TRISB0                        146
#define TRISB1                        147
#define TRISB2                        148
#define TRISB3                        149
#define TRISB4                        150
#define TRISB5                        151
#define TRISB6                        152
#define TRISB7                        153
#define TRISC                         154
#define TRISC0                        155
#define TRISC1                        156
#define TRISC2                        157
#define TRISC3                        158
#define TRISC4                        159
#define TRISC5                        160
#define TRISC6                        161
#define TRISC7                        162
#define TRISE                         163
#define TRISE3                        164
#define PIE1                          165
#define TMR1IE                        166
#define TMR2IE                        167
#define CCP1IE                        168
#define SSPIE                         169
#define TXIE                          170
#define RCIE                          171
#define ADIE                          172
#define TMR1GIE                       173
#define PIE2                          174
#define CCP2IE                        175
#define LCDIE                         176
#define BCLIE                         177
#define EEIE                          178
#define C1IE                          179
#define C2IE                          180
#define OSFIE                         181
#define PIE3                          182
#define TMR4IE                        183
#define TMR6IE                        184
#define CCP3IE                        185
#define CCP4IE                        186
#define CCP5IE                        187
#define OPTION_REG                    188
#define PS                            189
#define PS0                           190
#define PS1                           191
#define PS2                           192
#define PSA                           193
#define T0SE                          194
#define TMR0SE                        195
#define T0CS                          196
#define TMR0CS                        197
#define INTEDG                        198
#define nWPUEN                        199
#define PCON                          200
#define nBOR                          201
#define nPOR                          202
#define nRI                           203
#define nRMCLR                        204
#define STKUNF                        205
#define STKOVF                        206
#define WDTCON                        207
#define SWDTEN                        208
#define WDTPS                         209
#define WDTPS0                        210
#define WDTPS1                        211
#define WDTPS2                        212
#define WDTPS3                        213
#define WDTPS4                        214
#define OSCTUNE                       215
#define TUN0                          216
#define TUN                           217
#define TUN1                          218
#define TUN2                          219
#define TUN3                          220
#define TUN4                          221
#define TUN5                          222
#define OSCCON                        223
#define SCS0                          224
#define SCS                           225
#define SCS1                          226
#define IRCF                          227
#define IRCF0                         228
#define IRCF1                         229
#define IRCF2                         230
#define IRCF3                         231
#define SPLLEN                        232
#define OSCSTAT                       233
#define HFIOFS                        234
#define LFIOFR                        235
#define MFIOFR                        236
#define HFIOFL                        237
#define HFIOFR                        238
#define OSTS                          239
#define PLLR                          240
#define T1OSCR                        241
#define ADRESL                        242
#define ADRESH                        243
#define ADCON0                        244
#define ADON                          245
#define nDONE                         246
#define GO_nDONE                      247
#define GO                            248
#define ADGO                          249
#define CHS0                          250
#define CHS                           251
#define CHS1                          252
#define CHS2                          253
#define CHS3                          254
#define CHS4                          255
#define ADCON1                        256
#define ADPREF0                       257
#define ADPREF                        258
#define ADPREF1                       259
#define ADNREF                        260
#define ADCS0                         261
#define ADCS                          262
#define ADCS1                         263
#define ADCS2                         264
#define ADFM                          265
#define LATA                          266
#define LATA0                         267
#define LATA1                         268
#define LATA2                         269
#define LATA3                         270
#define LATA4                         271
#define LATA5                         272
#define LATA6                         273
#define LATA7                         274
#define LATB                          275
#define LATB0                         276
#define LATB1                         277
#define LATB2                         278
#define LATB3                         279
#define LATB4                         280
#define LATB5                         281
#define LATB6                         282
#define LATB7                         283
#define LATC                          284
#define LATC0                         285
#define LATC1                         286
#define LATC2                         287
#define LATC3                         288
#define LATC4                         289
#define LATC5                         290
#define LATC6                         291
#define LATC7                         292
#define LATE                          293
#define LATE3                         294
#define CM1CON0                       295
#define C1SYNC                        296
#define C1HYS                         297
#define C1SP                          298
#define C1POL                         299
#define C1OE                          300
#define C1OUT                         301
#define C1ON                          302
#define CM1CON1                       303
#define C1NCH0                        304
#define C1NCH                         305
#define C1NCH1                        306
#define C1PCH                         307
#define C1PCH0                        308
#define C1PCH1                        309
#define C1INTN                        310
#define C1INTP                        311
#define CM2CON0                       312
#define C2SYNC                        313
#define C2HYS                         314
#define C2SP                          315
#define C2POL                         316
#define C2OE                          317
#define C2OUT                         318
#define C2ON                          319
#define CM2CON1                       320
#define C2NCH0                        321
#define C2NCH                         322
#define C2NCH1                        323
#define C2PCH                         324
#define C2PCH0                        325
#define C2PCH1                        326
#define C2INTN                        327
#define C2INTP                        328
#define CMOUT                         329
#define MC1OUT                        330
#define MC2OUT                        331
#define BORCON                        332
#define BORRDY                        333
#define SBOREN                        334
#define FVRCON                        335
#define ADFVR0                        336
#define ADFVR                         337
#define ADFVR1                        338
#define CDAFVR0                       339
#define CDAFVR                        340
#define CDAFVR1                       341
#define TSRNG                         342
#define TSEN                          343
#define FVRRDY                        344
#define FVREN                         345
#define DACCON0                       346
#define DACNSS                        347
#define DACPSS                        348
#define DACPSS0                       349
#define DACPSS1                       350
#define DACOE                         351
#define DACLPS                        352
#define DACEN                         353
#define DACCON1                       354
#define DACR0                         355
#define DACR                          356
#define DACR1                         357
#define DACR2                         358
#define DACR3                         359
#define DACR4                         360
#define SRCON0                        361
#define SRPR                          362
#define SRPS                          363
#define SRNQEN                        364
#define SRQEN                         365
#define SRCLK0                        366
#define SRCLK                         367
#define SRCLK1                        368
#define SRCLK2                        369
#define SRLEN                         370
#define SRCON1                        371
#define SRRC1E                        372
#define SRRC2E                        373
#define SRRCKE                        374
#define SRRPE                         375
#define SRSC1E                        376
#define SRSC2E                        377
#define SRSCKE                        378
#define SRSPE                         379
#define APFCON                        380
#define CCP2SEL                       381
#define SSSEL                         382
#define C2OUTSEL                      383
#define SRNQSEL                       384
#define P2BSEL                        385
#define T1GSEL                        386
#define CCP3SEL                       387
#define ANSA0                         388
#define ANSELA                        389
#define ANSA1                         390
#define ANSA2                         391
#define ANSA3                         392
#define ANSA4                         393
#define ANSA5                         394
#define ANSB0                         395
#define ANSELB                        396
#define ANSB1                         397
#define ANSB2                         398
#define ANSB3                         399
#define ANSB4                         400
#define ANSB5                         401
#define EEADRL                        402
#define EEADRH                        403
#define EEDATL                        404
#define EEDATH                        405
#define EECON1                        406
#define RD                            407
#define WR                            408
#define WREN                          409
#define WRERR                         410
#define FREE                          411
#define LWLO                          412
#define CFGS                          413
#define EEPGD                         414
#define EECON2                        415
#define RCREG                         416
#define TXREG                         417
#define SP1BRGL                       418
#define SPBRGL                        419
#define SP1BRGH                       420
#define SPBRGH                        421
#define RCSTA                         422
#define RX9D                          423
#define OERR                          424
#define FERR                          425
#define ADDEN                         426
#define CREN                          427
#define SREN                          428
#define RX9                           429
#define SPEN                          430
#define TXSTA                         431
#define TX9D                          432
#define TRMT                          433
#define BRGH                          434
#define SENDB                         435
#define SYNC                          436
#define TXEN                          437
#define TX9                           438
#define CSRC                          439
#define BAUDCON                       440
#define ABDEN                         441
#define WUE                           442
#define BRG16                         443
#define SCKP                          444
#define RCIDL                         445
#define ABDOVF                        446
#define WPUB0                         447
#define WPUB                          448
#define WPUB1                         449
#define WPUB2                         450
#define WPUB3                         451
#define WPUB4                         452
#define WPUB5                         453
#define WPUB6                         454
#define WPUB7                         455
#define WPUE                          456
#define WPUE3                         457
#define SSPBUF                        458
#define SSPADD                        459
#define SSPMSK                        460
#define SSPSTAT                       461
#define BF                            462
#define UA                            463
#define R_nW                          464
#define S                             465
#define P                             466
#define D_nA                          467
#define CKE                           468
#define SMP                           469
#define SSPCON1                       470
#define SSPM0                         471
#define SSPM1                         472
#define SSPM2                         473
#define SSPM3                         474
#define CKP                           475
#define SSPEN                         476
#define SSPOV                         477
#define WCOL                          478
#define SSPCON2                       479
#define SEN                           480
#define RSEN                          481
#define PEN                           482
#define RCEN                          483
#define ACKEN                         484
#define ACKDT                         485
#define ACKSTAT                       486
#define GCEN                          487
#define SSPCON3                       488
#define DHEN                          489
#define AHEN                          490
#define SBCDE                         491
#define SDAHT                         492
#define BOEN                          493
#define SCIE                          494
#define PCIE                          495
#define ACKTIM                        496
#define CCPR1L                        497
#define CCPR1H                        498
#define CCP1CON                       499
#define CCP1M0                        500
#define CCP1M                         501
#define CCP1M1                        502
#define CCP1M2                        503
#define CCP1M3                        504
#define DC1B                          505
#define DC1B0                         506
#define DC1B1                         507
#define P1M                           508
#define P1M0                          509
#define P1M1                          510
#define PWM1CON                       511
#define P1DC0                         512
#define P1DC1                         513
#define P1DC2                         514
#define P1DC3                         515
#define P1DC4                         516
#define P1DC5                         517
#define P1DC6                         518
#define P1RSEN                        519
#define CCP1AS                        520
#define PSS1BD0                       521
