tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1933_tdd.h
#define PSS1BD1                       522
#define PSS1AC0                       523
#define PSS1AC1                       524
#define CCP1AS0                       525
#define CCP1AS1                       526
#define CCP1AS2                       527
#define CCP1ASE                       528
#define PSTR1CON                      529
#define STR1A                         530
#define STR1B                         531
#define STR1C                         532
#define STR1D                         533
#define STR1SYNC                      534
#define CCPR2L                        535
#define CCPR2H                        536
#define CCP2CON                       537
#define CCP2M                         538
#define CCP2M0                        539
#define CCP2M1                        540
#define CCP2M2                        541
#define CCP2M3                        542
#define DC2B                          543
#define DC2B0                         544
#define DC2B1                         545
#define P2M                           546
#define P2M0                          547
#define P2M1                          548
#define PWM2CON                       549
#define P2DC0                         550
#define P2DC1                         551
#define P2DC2                         552
#define P2DC3                         553
#define P2DC4                         554
#define P2DC5                         555
#define P2DC6                         556
#define P2RSEN                        557
#define CCP2AS                        558
#define PSS2BD0                       559
#define PSS2BD1                       560
#define PSS2AC0                       561
#define PSS2AC1                       562
#define CCP2AS0                       563
#define CCP2AS1                       564
#define CCP2AS2                       565
#define CCP2ASE                       566
#define PSTR2CON                      567
#define STR2A                         568
#define STR2B                         569
#define STR2C                         570
#define STR2D                         571
#define STR2SYNC                      572
#define CCPTMRS0                      573
#define C1TSEL0                       574
#define C1TSEL                        575
#define C1TSEL1                       576
#define C2TSEL0                       577
#define C2TSEL                        578
#define C2TSEL1                       579
#define C3TSEL0                       580
#define C3TSEL                        581
#define C3TSEL1                       582
#define C4TSEL                        583
#define C4TSEL0                       584
#define C4TSEL1                       585
#define CCPTMRS1                      586
#define C5TSEL                        587
#define C5TSEL0                       588
#define C5TSEL1                       589
#define CCPR3L                        590
#define CCPR3H                        591
#define CCP3CON                       592
#define CCP3M0                        593
#define CCP3M1                        594
#define CCP3M2                        595
#define CCP3M3                        596
#define DC3B0                         597
#define DC3B1                         598
#define P3M0                          599
#define P3M1                          600
#define PWM3CON                       601
#define P3DC0                         602
#define P3DC1                         603
#define P3DC2                         604
#define P3DC3                         605
#define P3DC4                         606
#define P3DC5                         607
#define P3DC6                         608
#define P3RSEN                        609
#define CCP3AS                        610
#define PSS3BD0                       611
#define PSS3BD1                       612
#define PSS3AC0                       613
#define PSS3AC1                       614
#define CCP3AS0                       615
#define CCP3AS1                       616
#define CCP3AS2                       617
#define CCP3ASE                       618
#define PSTR3CON                      619
#define STR3A                         620
#define STR3B                         621
#define STR3C                         622
#define STR3D                         623
#define STR3SYNC                      624
#define CCPR4L                        625
#define CCPR4H                        626
#define CCP4CON                       627
#define CCP4M0                        628
#define CCP4M1                        629
#define CCP4M2                        630
#define CCP4M3                        631
#define DC4B0                         632
#define DC4B1                         633
#define CCPR5L                        634
#define CCPR5H                        635
#define CCP5CON                       636
#define CCP5M0                        637
#define CCP5M1                        638
#define CCP5M2                        639
#define CCP5M3                        640
#define DC5B0                         641
#define DC5B1                         642
#define IOCBP                         643
#define IOCBP0                        644
#define IOCBP1                        645
#define IOCBP2                        646
#define IOCBP3                        647
#define IOCBP4                        648
#define IOCBP5                        649
#define IOCBP6                        650
#define IOCBP7                        651
#define IOCBN0                        652
#define IOCBN                         653
#define IOCBN1                        654
#define IOCBN2                        655
#define IOCBN3                        656
#define IOCBN4                        657
#define IOCBN5                        658
#define IOCBN6                        659
#define IOCBN7                        660
#define IOCBF0                        661
#define IOCBF                         662
#define IOCBF1                        663
#define IOCBF2                        664
#define IOCBF3                        665
#define IOCBF4                        666
#define IOCBF5                        667
#define IOCBF6                        668
#define IOCBF7                        669
#define TMR4                          670
#define PR4                           671
#define T4CON                         672
#define T4CKPS0                       673
#define T4CKPS                        674
#define T4CKPS1                       675
#define TMR4ON                        676
#define T4OUTPS                       677
#define T4OUTPS0                      678
#define T4OUTPS1                      679
#define T4OUTPS2                      680
#define T4OUTPS3                      681
#define TMR6                          682
#define PR6                           683
#define T6CON                         684
#define T6CKPS0                       685
#define T6CKPS                        686
#define T6CKPS1                       687
#define TMR6ON                        688
#define T6OUTPS0                      689
#define T6OUTPS                       690
#define T6OUTPS1                      691
#define T6OUTPS2                      692
#define T6OUTPS3                      693
#define LCDCON                        694
#define LMUX0                         695
#define LMUX                          696
#define LMUX1                         697
#define CS                            698
#define CS0                           699
#define CS1                           700
#define WERR                          701
#define SLPEN                         702
#define LCDEN                         703
#define LCDPS                         704
#define LP                            705
#define LP0                           706
#define LP1                           707
#define LP2                           708
#define LP3                           709
#define WA                            710
#define LCDA                          711
#define BIASMD                        712
#define WFT                           713
#define LCDREF                        714
#define VLCD1PE                       715
#define VLCD2PE                       716
#define VLCD3PE                       717
#define LCDIRI                        718
#define LCDIRS                        719
#define LCDIRE                        720
#define LCDCST0                       721
#define LCDCST                        722
#define LCDCST1                       723
#define LCDCST2                       724
#define LCDRL                         725
#define LRLAT0                        726
#define LRLAT                         727
#define LRLAT1                        728
#define LRLAT2                        729
#define LRLBP                         730
#define LRLBP0                        731
#define LRLBP1                        732
#define LRLAP0                        733
#define LRLAP                         734
#define LRLAP1                        735
#define LCDSE0                        736
#define SE0                           737
#define SE1                           738
#define SE2                           739
#define SE3                           740
#define SE4                           741
#define SE5                           742
#define SE6                           743
#define SE7                           744
#define LCDSE1                        745
#define SE8                           746
#define SE9                           747
#define SE10                          748
#define SE11                          749
#define SE12                          750
#define SE13                          751
#define SE14                          752
#define SE15                          753
#define LCDDATA0                      754
#define SEG0COM0                      755
#define SEG1COM0                      756
#define SEG2COM0                      757
#define SEG3COM0                      758
#define SEG4COM0                      759
#define SEG5COM0                      760
#define SEG6COM0                      761
#define SEG7COM0                      762
#define LCDDATA1                      763
#define SEG8COM0                      764
#define SEG9COM0                      765
#define SEG10COM0                     766
#define SEG11COM0                     767
#define SEG12COM0                     768
#define SEG13COM0                     769
#define SEG14COM0                     770
#define SEG15COM0                     771
#define LCDDATA3                      772
#define SEG0COM1                      773
#define SEG1COM1                      774
#define SEG2COM1                      775
#define SEG3COM1                      776
#define SEG4COM1                      777
#define SEG5COM1                      778
#define SEG6COM1                      779
#define SEG7COM1                      780
#define LCDDATA4                      781
#define SEG8COM1                      782
#define SEG9COM1                      783
#define SEG10COM1                     784
#define SEG11COM1                     785
#define SEG12COM1                     786
#define SEG13COM1                     787
#define SEG14COM1                     788
#define SEG15COM1                     789
#define LCDDATA6                      790
#define SEG0COM2                      791
#define SEG1COM2                      792
#define SEG2COM2                      793
#define SEG3COM2                      794
#define SEG4COM2                      795
#define SEG5COM2                      796
#define SEG6COM2                      797
#define SEG7COM2                      798
#define LCDDATA7                      799
#define SEG8COM2                      800
#define SEG9COM2                      801
#define SEG10COM2                     802
#define SEG11COM2                     803
#define SEG12COM2                     804
#define SEG13COM2                     805
#define SEG14COM2                     806
#define SEG15COM2                     807
#define LCDDATA9                      808
#define SEG0COM3                      809
#define SEG1COM3                      810
#define SEG2COM3                      811
#define SEG3COM3                      812
#define SEG4COM3                      813
#define SEG5COM3                      814
#define SEG6COM3                      815
#define SEG7COM3                      816
#define LCDDATA10                     817
#define SEG8COM3                      818
#define SEG9COM3                      819
#define SEG10COM3                     820
#define SEG11COM3                     821
#define SEG12COM3                     822
#define SEG13COM3                     823
#define SEG14COM3                     824
#define SEG15COM3                     825
#define STATUS_SHAD                   826
#define C_SHAD                        827
#define DC_SHAD                       828
#define Z_SHAD                        829
#define WREG_SHAD                     830
#define BSR_SHAD                      831
#define PCLATH_SHAD                   832
#define FSR0L_SHAD                    833
#define FSR0H_SHAD                    834
#define FSR1L_SHAD                    835
#define FSR1H_SHAD                    836
#define STKPTR                        837
#define TOSL                          838
#define TOSH                          839

#endif // _PIC16F1933_H_
